/*************************************************************************************************** 
                                   xxxx公司
  
                  

文件:   fifo.c 
作者:   龙川
说明:   FIFO队列.
***************************************************************************************************/

/***************************************************************************************************
文件:   头文件.
***************************************************************************************************/
#include "fifo.h"
#include <string.h>

/***************************************************************************************************
定义:   全局变量.
***************************************************************************************************/


/***************************************************************************************************
定义:   静态变量.
***************************************************************************************************/
/**
****************************************************************************************
@brief:   uint32_t minw(uint32_t a, uint32_t b)寻找最小值
@Input：  a   无符号整形a.
          b   无符号整形b.
@Output： NULL
@Return   返回两个数据之前的较小值.
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
uint32_t minw(uint32_t a, uint32_t b)
{    
    return (a<b ? a : b);
}

/**
****************************************************************************************
@brief:   fifo_data_length
@Input：  bp   CFifo指针.
@Output： NULL
@Return   CFifo指针所指向容器中的数据长度.
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
uint32_t fifo_data_length(CFifo *bp)
{    
    return ((uint32_t)((bp->in -bp->out) & (bp->len-1)));
}

/***************************************************************************************************
函数:   函数FifoUntriedlen
输入:   bp   CFifo指针.
返回:   CFifo指针所指向缓冲区中能尝试出队的数据长度.
说明:   .
***************************************************************************************************/
uint32_t fifo_untried_len(CFifo *bp)
{    
    return ((uint32_t)((bp->in - bp->trial) & (bp->len-1)));
}

/**
****************************************************************************************
@brief:   fifo_try_len
@Input：  bp   CFifo指针.
@Output： NULL
@Return   CFifo指针所指向缓冲区中未确认出队的数据长度.
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
uint32_t fifo_try_len(CFifo *bp)
{    
    return ((uint32_t)((bp->trial - bp->out) & (bp->len -1)));
}

/**
****************************************************************************************
@brief:   fifo_free_len
@Input：  bp   CFifo指针.
@Output： NULL
@Return   bp所指向缓冲区空闲长度.
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
uint32_t fifo_free_len(CFifo *bp)
{    
    return (bp->len ? bp->len-1 - fifo_data_length(bp) : 0);
}
/**
****************************************************************************************
@brief:   fifo_init 初始化bp指针的缓冲区长度 .
@Input：  bp   CFifo指针.
					size bp指针的缓冲区长度   
@Output： NULL
@Return   NULL
@Warning: FIFO的长度只能是2^n 如128 256 512 1024 等
@note:   龙川2019-4-2
****************************************************************************************
 **/
void fifo_init(CFifo *bp, uint32_t size)
{    
    bp->out = bp->in = bp->trial = 0;
    bp->len=size;
}

/**
****************************************************************************************
@brief:   fifo_reset 复位FIFO指针
@Input：  bp   CFifo指针.
@Output： NULL
@Return   NULL
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
void fifo_reset(CFifo *bp)
{    
    bp->out = bp->in = bp->trial = 0;
}

/**
****************************************************************************************
@brief:   fifo_in
@Input：  bp   CFifo指针.
          data 入队数据所指向的指针.
          len  入队的数据长度.
@Output： NULL
@Return   实际入队的数据长度.
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
uint32_t fifo_in(CFifo *bp, uint8_t *data, uint32_t len)
{    
    uint32_t in, n, n1, n2;

    in = (uint32_t)bp->in & (bp->len-1);         
    n  = minw(len, fifo_free_len(bp));         
    n1 = minw(n,(uint32_t)(bp->len - in));    
    n2 = n - n1;                                                
    if(n1 && data)                                            
        memcpy (&bp->data[in], data, n1);    
    if(n2 && data)                                             
        memcpy (bp->data, &data[n1], n2); 
    bp->in += n;                                                
    return (n);
}



/**
****************************************************************************************
@brief:   fifo_in_forcibly 
@Input：  bp   CFifo指针.
          data 入队数据所指向的指针.
          len  入队的数据长度.
@Output： NULL
@Return   实际入队的数据长度.
@Warning: 强制入队，没空间会清空间 
@note:   龙川2019-4-2
****************************************************************************************
 **/
uint32_t fifo_in_forcibly(CFifo *bp, uint8_t *data, uint32_t len)
{    
    if (fifo_free_len(bp) < len)
    {
        fifo_out(bp,(unsigned char *)0,(len-fifo_free_len(bp)));
    }
    
    return fifo_in(bp,data,len);
}
/**
****************************************************************************************
@brief:   fifo_try 
@Input：  bp   CFifo指针.
          data    出队数据所指向的指针.
          maxlen  出队的数据长度.
@Output： NULL
@Return   尝试实际出队的数据长度.
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
uint32_t fifo_try(CFifo *bp, uint8_t *data, uint32_t maxlen)
{    
    uint32_t trial, n, n1, n2;
    trial = (uint32_t)bp->trial & (bp->len-1);             
    n  = minw(maxlen, fifo_untried_len(bp));             
    n1 = minw(n,(uint32_t)(bp->len -trial));                 
    n2 = n - n1;                                                                
    if(n1 && data)                                                             
        memcpy(data, &bp->data[trial], n1);            
    if(n2 && data)                                                            
        memcpy(&data[n1], bp->data, n2);                
    bp->trial += n;                                                    
    return(n);
}
/**
****************************************************************************************
@brief:   fifo_out 
@Input：  bp   CFifo指针.
          data    出队数据所指向的指针.
          maxlen  出队的数据长度.
@Output： NULL
@Return   实际出队的数据长度.
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
uint32_t fifo_out(CFifo *bp, uint8_t *data, uint32_t maxlen)
{    
    uint32_t out, n, n1, n2;
    out = (uint32_t)bp->out & (bp->len-1);        
    n  = minw(maxlen, fifo_data_length(bp));                
    n1 = minw(n, (uint32_t)(bp->len - out));    
    n2 = n - n1;                                                    
    if(n1 && data)                                        
        memcpy(data, &bp->data[out], n1);        
    if(n2 && data)                                        
        memcpy(&data[n1], bp->data, n2);        
    bp->out +=n;                                                    
                        
    bp->trial = bp->out;
    return(n);
}

/**
****************************************************************************************
@brief:   fifo_untry 
@Input：  bp   CFifo指针.
@Output： NULL
@Return   NULL
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
void fifo_untry(CFifo *bp)
{
    bp->trial = bp->out;
}

/**
****************************************************************************************
@brief:   fifo_out_sync 
@Input：  bp   CFifo指针.
@Output： NULL
@Return   NULL
@Warning: NULL
@note:   龙川2019-4-2
****************************************************************************************
 **/
void fifo_out_sync(CFifo *bp)
{
    bp->out = bp->trial;
}
/***************************************************************************************************
文件结束.
***************************************************************************************************/
